app/controllers/produtos_controller.rb

	def new
		@produto = Produto.new
		@departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

	def index
		@produtos_por_nome = Produto.order(:nome)
		@produtos_por_preco = Produto.order(:preco).limit 2
---
SELECT "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2

	def create
		@produto = Produto.new produto_params
		if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "camiseta azul"], ["descricao", "camiseta azul legal"], ["quantidade", 20], ["preco", 70.0], ["created_at", "2016-12-14 15:31:45.845587"], ["updated_at", "2016-12-14 15:31:45.845587"]]

	def update
		if @produto.update produto_params
---
UPDATE "produtos" SET "nome" = ?, "departamento_id" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Bermuda do Big Bang leagal"], ["departamento_id", 1], ["updated_at", "2016-12-18 21:54:19.945597"], ["id", 3]]

	def destroy
		@produto.destroy
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 5]]

	def busca
		@nome_a_buscar = params[:nome]
		@produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%{@nome_a_buscar}%')

	def set_produto
		id = params[:id]
		@produto = Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", nil]]