app/controllers/produtos_controller.rb

	def index
		@produtos_por_nome = Produto.order(:nome).limit 5
---
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5